GopalSaraf/Practicals/PSDL/include/proc/pic18f26k40.inc
// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 0EB5h
// bitfield definitions
RX1PPS_PIN_POSN                          equ 0000h
RX1PPS_PIN_POSITION                      equ 0000h
RX1PPS_PIN_SIZE                          equ 0003h
RX1PPS_PIN_LENGTH                        equ 0003h
RX1PPS_PIN_MASK                          equ 0007h
RX1PPS_PORT_POSN                         equ 0003h
RX1PPS_PORT_POSITION                     equ 0003h
RX1PPS_PORT_SIZE                         equ 0002h
RX1PPS_PORT_LENGTH                       equ 0002h
RX1PPS_PORT_MASK                         equ 0018h
RX1PPS_RXPPS_POSN                        equ 0000h
RX1PPS_RXPPS_POSITION                    equ 0000h
RX1PPS_RXPPS_SIZE                        equ 0005h
RX1PPS_RXPPS_LENGTH                      equ 0005h
RX1PPS_RXPPS_MASK                        equ 001Fh
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0005h
RX1PPS_RX1PPS_LENGTH                     equ 0005h
RX1PPS_RX1PPS_MASK                       equ 001Fh
RX1PPS_RX1PPS0_POSN                      equ 0000h
RX1PPS_RX1PPS0_POSITION                  equ 0000h
RX1PPS_RX1PPS0_SIZE                      equ 0001h
RX1PPS_RX1PPS0_LENGTH                    equ 0001h
RX1PPS_RX1PPS0_MASK                      equ 0001h
RX1PPS_RX1PPS1_POSN                      equ 0001h
RX1PPS_RX1PPS1_POSITION                  equ 0001h
RX1PPS_RX1PPS1_SIZE                      equ 0001h
RX1PPS_RX1PPS1_LENGTH                    equ 0001h
RX1PPS_RX1PPS1_MASK                      equ 0002h
RX1PPS_RX1PPS2_POSN                      equ 0002h
RX1PPS_RX1PPS2_POSITION                  equ 0002h
RX1PPS_RX1PPS2_SIZE                      equ 0001h
RX1PPS_RX1PPS2_LENGTH                    equ 0001h
RX1PPS_RX1PPS2_MASK                      equ 0004h
RX1PPS_RX1PPS3_POSN                      equ 0003h
RX1PPS_RX1PPS3_POSITION                  equ 0003h
RX1PPS_RX1PPS3_SIZE                      equ 0001h
RX1PPS_RX1PPS3_LENGTH                    equ 0001h
RX1PPS_RX1PPS3_MASK                      equ 0008h
RX1PPS_RX1PPS4_POSN                      equ 0004h
RX1PPS_RX1PPS4_POSITION                  equ 0004h
RX1PPS_RX1PPS4_SIZE                      equ 0001h
RX1PPS_RX1PPS4_LENGTH                    equ 0001h
RX1PPS_RX1PPS4_MASK                      equ 0010h

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 0EB6h
// bitfield definitions
CK1PPS_PIN_POSN                          equ 0000h
CK1PPS_PIN_POSITION                      equ 0000h
CK1PPS_PIN_SIZE                          equ 0003h
CK1PPS_PIN_LENGTH                        equ 0003h
CK1PPS_PIN_MASK                          equ 0007h
CK1PPS_PORT_POSN                         equ 0003h
CK1PPS_PORT_POSITION                     equ 0003h
CK1PPS_PORT_SIZE                         equ 0002h
CK1PPS_PORT_LENGTH                       equ 0002h
CK1PPS_PORT_MASK                         equ 0018h
CK1PPS_TXPPS_POSN                        equ 0000h
CK1PPS_TXPPS_POSITION                    equ 0000h
CK1PPS_TXPPS_SIZE                        equ 0005h
CK1PPS_TXPPS_LENGTH                      equ 0005h
CK1PPS_TXPPS_MASK                        equ 001Fh
CK1PPS_TX1PPS0_POSN                      equ 0000h
CK1PPS_TX1PPS0_POSITION                  equ 0000h
CK1PPS_TX1PPS0_SIZE                      equ 0001h
CK1PPS_TX1PPS0_LENGTH                    equ 0001h
CK1PPS_TX1PPS0_MASK                      equ 0001h
CK1PPS_TX1PPS1_POSN                      equ 0001h
CK1PPS_TX1PPS1_POSITION                  equ 0001h
CK1PPS_TX1PPS1_SIZE                      equ 0001h
CK1PPS_TX1PPS1_LENGTH                    equ 0001h
CK1PPS_TX1PPS1_MASK                      equ 0002h
CK1PPS_TX1PPS2_POSN                      equ 0002h
CK1PPS_TX1PPS2_POSITION                  equ 0002h
CK1PPS_TX1PPS2_SIZE                      equ 0001h
CK1PPS_TX1PPS2_LENGTH                    equ 0001h
CK1PPS_TX1PPS2_MASK                      equ 0004h
CK1PPS_TX1PPS3_POSN                      equ 0003h
CK1PPS_TX1PPS3_POSITION                  equ 0003h
CK1PPS_TX1PPS3_SIZE                      equ 0001h
CK1PPS_TX1PPS3_LENGTH                    equ 0001h
CK1PPS_TX1PPS3_MASK                      equ 0008h
CK1PPS_TX1PPS4_POSN                      equ 0004h
CK1PPS_TX1PPS4_POSITION                  equ 0004h
CK1PPS_TX1PPS4_SIZE                      equ 0001h
CK1PPS_TX1PPS4_LENGTH                    equ 0001h
CK1PPS_TX1PPS4_MASK                      equ 0010h
CK1PPS_TX1PPS_POSN                       equ 0000h
CK1PPS_TX1PPS_POSITION                   equ 0000h
CK1PPS_TX1PPS_SIZE                       equ 0005h
CK1PPS_TX1PPS_LENGTH                     equ 0005h
CK1PPS_TX1PPS_MASK                       equ 001Fh

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0EB7h
// bitfield definitions
SSP1CLKPPS_PIN_POSN                      equ 0000h
SSP1CLKPPS_PIN_POSITION                  equ 0000h
SSP1CLKPPS_PIN_SIZE                      equ 0003h
SSP1CLKPPS_PIN_LENGTH                    equ 0003h
SSP1CLKPPS_PIN_MASK                      equ 0007h
SSP1CLKPPS_PORT_POSN                     equ 0003h
SSP1CLKPPS_PORT_POSITION                 equ 0003h
SSP1CLKPPS_PORT_SIZE                     equ 0002h
SSP1CLKPPS_PORT_LENGTH                   equ 0002h
SSP1CLKPPS_PORT_MASK                     equ 0018h
SSP1CLKPPS_SSPCLKPPS_POSN                equ 0000h
SSP1CLKPPS_SSPCLKPPS_POSITION            equ 0000h
SSP1CLKPPS_SSPCLKPPS_SIZE                equ 0005h
SSP1CLKPPS_SSPCLKPPS_LENGTH              equ 0005h
SSP1CLKPPS_SSPCLKPPS_MASK                equ 001Fh

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0EB8h
// bitfield definitions
SSP1DATPPS_PIN_POSN                      equ 0000h
SSP1DATPPS_PIN_POSITION                  equ 0000h
SSP1DATPPS_PIN_SIZE                      equ 0003h
SSP1DATPPS_PIN_LENGTH                    equ 0003h
SSP1DATPPS_PIN_MASK                      equ 0007h
SSP1DATPPS_PORT_POSN                     equ 0003h
SSP1DATPPS_PORT_POSITION                 equ 0003h
SSP1DATPPS_PORT_SIZE                     equ 0002h
SSP1DATPPS_PORT_LENGTH                   equ 0002h
SSP1DATPPS_PORT_MASK                     equ 0018h
SSP1DATPPS_SSPDATPPS_POSN                equ 0000h
SSP1DATPPS_SSPDATPPS_POSITION            equ 0000h
SSP1DATPPS_SSPDATPPS_SIZE                equ 0005h
SSP1DATPPS_SSPDATPPS_LENGTH              equ 0005h
SSP1DATPPS_SSPDATPPS_MASK                equ 001Fh

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0EB9h
// bitfield definitions
SSP1SSPPS_PIN_POSN                       equ 0000h
SSP1SSPPS_PIN_POSITION                   equ 0000h
SSP1SSPPS_PIN_SIZE                       equ 0003h
SSP1SSPPS_PIN_LENGTH                     equ 0003h
SSP1SSPPS_PIN_MASK                       equ 0007h
SSP1SSPPS_PORT_POSN                      equ 0003h
SSP1SSPPS_PORT_POSITION                  equ 0003h
SSP1SSPPS_PORT_SIZE                      equ 0002h
SSP1SSPPS_PORT_LENGTH                    equ 0002h
SSP1SSPPS_PORT_MASK                      equ 0018h
SSP1SSPPS_SSPSSPPS_POSN                  equ 0000h
SSP1SSPPS_SSPSSPPS_POSITION              equ 0000h
SSP1SSPPS_SSPSSPPS_SIZE                  equ 0005h
SSP1SSPPS_SSPSSPPS_LENGTH                equ 0005h
SSP1SSPPS_SSPSSPPS_MASK                  equ 001Fh

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 0EBAh
// bitfield definitions
IPR0_INT0IP_POSN                         equ 0000h
IPR0_INT0IP_POSITION                     equ 0000h
IPR0_INT0IP_SIZE                         equ 0001h
IPR0_INT0IP_LENGTH                       equ 0001h
IPR0_INT0IP_MASK                         equ 0001h
IPR0_INT1IP_POSN                         equ 0001h
IPR0_INT1IP_POSITION                     equ 0001h
IPR0_INT1IP_SIZE                         equ 0001h
IPR0_INT1IP_LENGTH                       equ 0001h
IPR0_INT1IP_MASK                         equ 0002h
IPR0_INT2IP_POSN                         equ 0002h
IPR0_INT2IP_POSITION                     equ 0002h
IPR0_INT2IP_SIZE                         equ 0001h
IPR0_INT2IP_LENGTH                       equ 0001h
IPR0_INT2IP_MASK                         equ 0004h
IPR0_IOCIP_POSN                          equ 0004h
IPR0_IOCIP_POSITION                      equ 0004h
IPR0_IOCIP_SIZE                          equ 0001h
IPR0_IOCIP_LENGTH                        equ 0001h
IPR0_IOCIP_MASK                          equ 0010h
IPR0_TMR0IP_POSN                         equ 0005h
IPR0_TMR0IP_POSITION                     equ 0005h
IPR0_TMR0IP_SIZE                         equ 0001h
IPR0_TMR0IP_LENGTH                       equ 0001h
IPR0_TMR0IP_MASK                         equ 0020h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0EBBh
// bitfield definitions
IPR1_ADIP_POSN                           equ 0000h
IPR1_ADIP_POSITION                       equ 0000h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0001h
IPR1_ADTIP_POSN                          equ 0001h
IPR1_ADTIP_POSITION                      equ 0001h
IPR1_ADTIP_SIZE                          equ 0001h
IPR1_ADTIP_LENGTH                        equ 0001h
IPR1_ADTIP_MASK                          equ 0002h
IPR1_CSWIP_POSN                          equ 0006h
IPR1_CSWIP_POSITION                      equ 0006h
IPR1_CSWIP_SIZE                          equ 0001h
IPR1_CSWIP_LENGTH                        equ 0001h
IPR1_CSWIP_MASK                          equ 0040h
IPR1_OSCFIP_POSN                         equ 0007h
IPR1_OSCFIP_POSITION                     equ 0007h
IPR1_OSCFIP_SIZE                         equ 0001h
IPR1_OSCFIP_LENGTH                       equ 0001h
IPR1_OSCFIP_MASK                         equ 0080h
IPR1_PSPIP_POSN                          equ 0007h
IPR1_PSPIP_POSITION                      equ 0007h
IPR1_PSPIP_SIZE                          equ 0001h
IPR1_PSPIP_LENGTH                        equ 0001h
IPR1_PSPIP_MASK                          equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0EBCh
// bitfield definitions
IPR2_C1IP_POSN                           equ 0000h
IPR2_C1IP_POSITION                       equ 0000h
IPR2_C1IP_SIZE                           equ 0001h
IPR2_C1IP_LENGTH                         equ 0001h
IPR2_C1IP_MASK                           equ 0001h
IPR2_C2IP_POSN                           equ 0001h
IPR2_C2IP_POSITION                       equ 0001h
IPR2_C2IP_SIZE                           equ 0001h
IPR2_C2IP_LENGTH                         equ 0001h
IPR2_C2IP_MASK                           equ 0002h
IPR2_ZCDIP_POSN                          equ 0006h
IPR2_ZCDIP_POSITION                      equ 0006h
IPR2_ZCDIP_SIZE                          equ 0001h
IPR2_ZCDIP_LENGTH                        equ 0001h
IPR2_ZCDIP_MASK                          equ 0040h
IPR2_HLVDIP_POSN                         equ 0007h
IPR2_HLVDIP_POSITION                     equ 0007h
IPR2_HLVDIP_SIZE                         equ 0001h
IPR2_HLVDIP_LENGTH                       equ 0001h
IPR2_HLVDIP_MASK                         equ 0080h
IPR2_CMIP_POSN                           equ 0006h
IPR2_CMIP_POSITION                       equ 0006h
IPR2_CMIP_SIZE                           equ 0001h
IPR2_CMIP_LENGTH                         equ 0001h
IPR2_CMIP_MASK                           equ 0040h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0EBDh
// bitfield definitions
IPR3_SSP1IP_POSN                         equ 0000h
IPR3_SSP1IP_POSITION                     equ 0000h
IPR3_SSP1IP_SIZE                         equ 0001h
IPR3_SSP1IP_LENGTH                       equ 0001h
IPR3_SSP1IP_MASK                         equ 0001h
IPR3_BCL1IP_POSN                         equ 0001h
IPR3_BCL1IP_POSITION                     equ 0001h
IPR3_BCL1IP_SIZE                         equ 0001h
IPR3_BCL1IP_LENGTH                       equ 0001h
IPR3_BCL1IP_MASK                         equ 0002h
IPR3_SSP2IP_POSN                         equ 0002h
IPR3_SSP2IP_POSITION                     equ 0002h
IPR3_SSP2IP_SIZE                         equ 0001h
IPR3_SSP2IP_LENGTH                       equ 0001h
IPR3_SSP2IP_MASK                         equ 0004h
IPR3_BCL2IP_POSN                         equ 0003h
IPR3_BCL2IP_POSITION                     equ 0003h
IPR3_BCL2IP_SIZE                         equ 0001h
IPR3_BCL2IP_LENGTH                       equ 0001h
IPR3_BCL2IP_MASK                         equ 0008h
IPR3_TX1IP_POSN                          equ 0004h
IPR3_TX1IP_POSITION                      equ 0004h
IPR3_TX1IP_SIZE                          equ 0001h
IPR3_TX1IP_LENGTH                        equ 0001h
IPR3_TX1IP_MASK                          equ 0010h
IPR3_RC1IP_POSN                          equ 0005h
IPR3_RC1IP_POSITION                      equ 0005h
IPR3_RC1IP_SIZE                          equ 0001h
IPR3_RC1IP_LENGTH                        equ 0001h
IPR3_RC1IP_MASK                          equ 0020h
IPR3_TX2IP_POSN                          equ 0006h
IPR3_TX2IP_POSITION                      equ 0006h
IPR3_TX2IP_SIZE                          equ 0001h
IPR3_TX2IP_LENGTH                        equ 0001h
IPR3_TX2IP_MASK                          equ 0040h
IPR3_RC2IP_POSN                          equ 0007h
IPR3_RC2IP_POSITION                      equ 0007h
IPR3_RC2IP_SIZE                          equ 0001h
IPR3_RC2IP_LENGTH                        equ 0001h
IPR3_RC2IP_MASK                          equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

